qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/stm32l0xx_hal_smbus.h
/** @defgroup SMBUS_Error_Code SMBUS Error Code 
  * @brief  SMBUS Error Code
  * @{
  */ 
#define HAL_SMBUS_ERROR_NONE       0x00 /*!< No error             */
#define HAL_SMBUS_ERROR_BERR       0x01 /*!< BERR error           */
#define HAL_SMBUS_ERROR_ARLO       0x02 /*!< ARLO error           */
#define HAL_SMBUS_ERROR_ACKF       0x04 /*!< ACKF error           */
#define HAL_SMBUS_ERROR_OVR        0x08 /*!< OVR error            */
#define HAL_SMBUS_ERROR_HALTIMEOUT 0x10 /*!< Timeout error        */
#define HAL_SMBUS_ERROR_BUSTIMEOUT 0x20 /*!< Bus Timeout error    */
#define HAL_SMBUS_ERROR_ALERT      0x40 /*!< Alert error          */
#define HAL_SMBUS_ERROR_PECERR     0x80 /*!< PEC error            */
/** 
  * @}
  */

/** 
  * @brief  SMBUS handle Structure definition  
  */
typedef struct
{
  I2C_TypeDef                  *Instance;       /*!< SMBUS registers base address            */
                                                                                            
  SMBUS_InitTypeDef            Init;            /*!< SMBUS communication parameters          */
                                                                                            
  uint8_t                      *pBuffPtr;       /*!< Pointer to SMBUS transfer buffer        */
                                                                                            
  uint16_t                     XferSize;        /*!< SMBUS transfer size                     */
                                                                                            
  __IO uint16_t                XferCount;       /*!< SMBUS transfer counter                  */
                                                                                            
  __IO uint32_t                XferOptions;     /*!< SMBUS transfer options                  */
                                                                                            
  __IO uint32_t                PreviousState;   /*!< SMBUS communication Previous tate       */
                                                                                            
  HAL_LockTypeDef              Lock;            /*!< SMBUS locking object                    */
                                                                                            
  __IO uint32_t                State;           /*!< SMBUS communication state               */

  __IO uint32_t                ErrorCode;       /*!< SMBUS Error code , see SMBUS_Error_Code */

}SMBUS_HandleTypeDef;

/* Exported constants --------------------------------------------------------*/

/** @defgroup SMBUS_Exported_Constants
  * @{
  */

/** @defgroup SMBUS_Analog_Filter
  * @{
  */
#define SMBUS_ANALOGFILTER_ENABLE              ((uint32_t)0x00000000)
#define SMBUS_ANALOGFILTER_DISABLE             I2C_CR1_ANFOFF

#define IS_SMBUS_ANALOG_FILTER(FILTER)          (((FILTER) == SMBUS_ANALOGFILTER_ENABLE) || \
                                                 ((FILTER) == SMBUS_ANALOGFILTER_DISABLE))
/**
  * @}
  */

/** @defgroup SMBUS_addressing_mode
  * @{
  */
#define SMBUS_ADDRESSINGMODE_7BIT               ((uint32_t)0x00000001) 
#define SMBUS_ADDRESSINGMODE_10BIT              ((uint32_t)0x00000002)

#define IS_SMBUS_ADDRESSING_MODE(MODE)          (((MODE) == SMBUS_ADDRESSINGMODE_7BIT)  || \
                                                 ((MODE) == SMBUS_ADDRESSINGMODE_10BIT))
/**
  * @}
  */

/** @defgroup SMBUS_dual_addressing_mode
  * @{
  */

#define SMBUS_DUALADDRESS_DISABLE              ((uint32_t)0x00000000)
#define SMBUS_DUALADDRESS_ENABLE               I2C_OAR2_OA2EN

#define IS_SMBUS_DUAL_ADDRESS(ADDRESS)          (((ADDRESS) == SMBUS_DUALADDRESS_DISABLE) || \
                                                 ((ADDRESS) == SMBUS_DUALADDRESS_ENABLE))
/**
  * @}
  */

/** @defgroup SMBUS_own_address2_masks
  * @{
  */

#define SMBUS_OA2_NOMASK                        ((uint8_t)0x00)
#define SMBUS_OA2_MASK01                        ((uint8_t)0x01)
#define SMBUS_OA2_MASK02                        ((uint8_t)0x02)
#define SMBUS_OA2_MASK03                        ((uint8_t)0x03)
#define SMBUS_OA2_MASK04                        ((uint8_t)0x04)
#define SMBUS_OA2_MASK05                        ((uint8_t)0x05)
#define SMBUS_OA2_MASK06                        ((uint8_t)0x06)
#define SMBUS_OA2_MASK07                        ((uint8_t)0x07)

#define IS_SMBUS_OWN_ADDRESS2_MASK(MASK)        (((MASK) == SMBUS_OA2_NOMASK)   || \
                                                 ((MASK) == SMBUS_OA2_MASK01)    || \
                                                 ((MASK) == SMBUS_OA2_MASK02)    || \
                                                 ((MASK) == SMBUS_OA2_MASK03)    || \
                                                 ((MASK) == SMBUS_OA2_MASK04)    || \
                                                 ((MASK) == SMBUS_OA2_MASK05)    || \
                                                 ((MASK) == SMBUS_OA2_MASK06)    || \
                                                 ((MASK) == SMBUS_OA2_MASK07))  
/**
  * @}
  */


/** @defgroup SMBUS_general_call_addressing_mode
  * @{
  */
#define SMBUS_GENERALCALL_DISABLE              ((uint32_t)0x00000000)
#define SMBUS_GENERALCALL_ENABLE               I2C_CR1_GCEN

#define IS_SMBUS_GENERAL_CALL(CALL)             (((CALL) == SMBUS_GENERALCALL_DISABLE) || \
                                                 ((CALL) == SMBUS_GENERALCALL_ENABLE))
/**
  * @}
  */

/** @defgroup SMBUS_nostretch_mode
  * @{
  */
#define SMBUS_NOSTRETCH_DISABLE                ((uint32_t)0x00000000)
#define SMBUS_NOSTRETCH_ENABLE                 I2C_CR1_NOSTRETCH

#define IS_SMBUS_NO_STRETCH(STRETCH)            (((STRETCH) == SMBUS_NOSTRETCH_DISABLE) || \
                                                 ((STRETCH) == SMBUS_NOSTRETCH_ENABLE))
/**
  * @}
  */

/** @defgroup SMBUS_packet_error_check_mode
  * @{
  */
#define SMBUS_PEC_DISABLE                       ((uint32_t)0x00000000)
#define SMBUS_PEC_ENABLE                        I2C_CR1_PECEN

#define IS_SMBUS_PEC(PEC)                       (((PEC) == SMBUS_PEC_DISABLE) || \
                                                 ((PEC) == SMBUS_PEC_ENABLE))
/**
  * @}
  */

/** @defgroup SMBUS_peripheral_mode
  * @{
  */
#define SMBUS_PERIPHERAL_MODE_SMBUS_HOST        (uint32_t)(I2C_CR1_SMBHEN)
#define SMBUS_PERIPHERAL_MODE_SMBUS_SLAVE       (uint32_t)(0x00000000)
#define SMBUS_PERIPHERAL_MODE_SMBUS_SLAVE_ARP   (uint32_t)(I2C_CR1_SMBDEN)

#define IS_SMBUS_PERIPHERAL_MODE(MODE)          (((MODE) == SMBUS_PERIPHERAL_MODE_SMBUS_HOST)   || \
                                                 ((MODE) == SMBUS_PERIPHERAL_MODE_SMBUS_SLAVE)  || \
                                                 ((MODE) == SMBUS_PERIPHERAL_MODE_SMBUS_SLAVE_ARP))
/**
  * @}
  */

